var dom = document.getElementById("sandian");
var myChart = echarts.init(dom);
var app = {};

option = {
    title: {
        text: '机票用户男女年龄人数分布',
        subtext: '来自智搜大数据平台'
    },
    grid: {
        left: '3%',
        right: '7%',
        bottom: '3%',
        containLabel: true
    },
    tooltip: {
        trigger: 'axis',
        showDelay: 0,
        formatter: function (params) {
            if (params.value.length > 1) {
                return params.seriesName + ' :<br/>'
                    + params.value[0] + '岁 '
                    + params.value[1] + '人 ';
            }
            else {
                return params.seriesName + ' :<br/>'
                    + params.name + ' : '
                    + params.value + '人 ';
            }
        },
        axisPointer: {
            show: true,
            type: 'cross',
            lineStyle: {
                type: 'dashed',
                width: 1
            }
        }
    },
    toolbox: {
        feature: {
            dataZoom: {},
            brush: {
                type: ['rect', 'polygon', 'clear']
            }
        }
    },
    brush: {},
    legend: {
        data: ['女性', '男性'],
        left: 'center'
    },
    xAxis: [
        {
            type: 'value',
            scale: true,
            axisLabel: {
                formatter: '{value} 岁'
            },
            splitLine: {
                show: false
            }
        }
    ],
    yAxis: [
        {
            type: 'value',
            scale: true,
            axisLabel: {
                formatter: '{value} 人'
            },
            splitLine: {
                show: false
            }
        }
    ],
    series: [
        {
            name: '女性',
            type: 'scatter',
            data: [
                [0, 33],
                [1, 468],
                [2, 1416],
                [3, 2287],
                [4, 3782],
                [5, 4446],
                [6, 5789],
                [7, 6816],
                [8, 7776],
                [9, 8761],
                [10, 8020],
                [11, 7612],
                [12, 8148],
                [13, 6437],
                [14, 7393],
                [15, 7130],
                [16, 8003],
                [17, 7880],
                [18, 9793],
                [19, 13419],
                [20, 20380],
                [21, 30253],
                [22, 41538],
                [23, 56612],
                [24, 71364],
                [25, 87914],
                [26, 121179],
                [27, 136970],
                [28, 138386],
                [29, 151826],
                [30, 142523],
                [31, 118802],
                [32, 109824],
                [33, 103525],
                [34, 110627],
                [35, 93217],
                [36, 74366],
                [37, 75242],
                [38, 70142],
                [39, 62827],
                [40, 62614],
                [41, 61656],
                [42, 59856],
                [43, 57981],
                [44, 57153],
                [45, 53583],
                [46, 54209],
                [47, 47879],
                [48, 49984],
                [49, 36014],
                [50, 38038],
                [51, 37465],
                [52, 38420],
                [53, 44414],
                [54, 33856],
                [55, 17974],
                [56, 18870],
                [57, 16990],
                [58, 19478],
                [59, 21252],
                [60, 19300],
                [61, 18350],
                [62, 18201],
                [63, 15441],
                [64, 13829],
                [65, 11240],
                [66, 9719],
                [67, 9301],
                [68, 7553],
                [69, 7156],
                [70, 6086],
                [71, 5344],
                [72, 4954],
                [73, 4265],
                [74, 4127],
                [75, 3652],
                [76, 3316],
                [77, 2786],
                [78, 2699],
                [79, 2127],
                [80, 1914],
                [81, 1584],
                [82, 1277],
                [83, 1137],
                [84, 758],
                [85, 555],
                [86, 462],
                [87, 303],
                [88, 242],
                [89, 163],
                [90, 104],
                [91, 87],
                [92, 51],
                [93, 43],
                [94, 41],
                [95, 25],
                [96, 17],
                [97, 3],
                [98, 6],
                [99, 13],
                [100, 4]
            ],
            markArea: {
                silent: true,
                itemStyle: {
                    normal: {
                        color: 'transparent',
                        borderWidth: 1,
                        borderType: 'dashed'
                    }
                },
                data: [[{
                    name: '女性分布区间',
                    xAxis: 'min',
                    yAxis: 'min'
                }, {
                    xAxis: 'max',
                    yAxis: 'max'
                }]]
            },
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'},
                    {type: 'min', name: '最小值'}
                ]
            },
            markLine: {
                lineStyle: {
                    normal: {
                        type: 'solid'
                    }
                },
                data: [
                    {type: 'average', name: '平均值'},
                    {xAxis: 160}
                ]
            }
        },
        {
            name: '男性',
            type: 'scatter',
            data: [
                [0, 38],
                [1, 535],
                [2, 1664],
                [3, 2672],
                [4, 4540],
                [5, 5510],
                [6, 6975],
                [7, 8254],
                [8, 9366],
                [9, 10608],
                [10, 9816],
                [11, 9301],
                [12, 9712],
                [13, 7748],
                [14, 8927],
                [15, 8648],
                [16, 9483],
                [17, 9080],
                [18, 10804],
                [19, 13590],
                [20, 18674],
                [21, 26297],
                [22, 33908],
                [23, 45154],
                [24, 56701],
                [25, 70815],
                [26, 98975],
                [27, 116348],
                [28, 122293],
                [29, 142277],
                [30, 144059],
                [31, 131923],
                [32, 137283],
                [33, 140360],
                [34, 160011],
                [35, 145233],
                [36, 125278],
                [37, 136545],
                [38, 132431],
                [39, 123680],
                [40, 128771],
                [41, 129522],
                [42, 129363],
                [43, 131651],
                [44, 131718],
                [45, 124920],
                [46, 124812],
                [47, 112005],
                [48, 115057],
                [49, 82943],
                [50, 86586],
                [51, 84795],
                [52, 84768],
                [53, 96105],
                [54, 72711],
                [55, 35769],
                [56, 36274],
                [57, 31944],
                [58, 36176],
                [59, 37366],
                [60, 32928],
                [61, 30848],
                [62, 29806],
                [63, 24118],
                [64, 21459],
                [65, 16709],
                [66, 14918],
                [67, 13858],
                [68, 10652],
                [69, 9609],
                [70, 8341],
                [71, 6960],
                [72, 6319],
                [73, 5339],
                [74, 5098],
                [75, 4451],
                [76, 4069],
                [77, 3267],
                [78, 3279],
                [79, 2863],
                [80, 2301],
                [81, 1872],
                [82, 1486],
                [83, 1352],
                [84, 871],
                [85, 782],
                [86, 651],
                [87, 404],
                [88, 328],
                [89, 227],
                [90, 152],
                [91, 117],
                [92, 82],
                [93, 44],
                [94, 51],
                [95, 29],
                [96, 21],
                [97, 15],
                [98, 10],
                [99, 9],
                [100, 6]
            ],
            markArea: {
                silent: true,
                itemStyle: {
                    normal: {
                        color: 'transparent',
                        borderWidth: 1,
                        borderType: 'dashed'
                    }
                },
                data: [[{
                    name: '男性分布区间',
                    xAxis: 'min',
                    yAxis: 'min'
                }, {
                    xAxis: 'max',
                    yAxis: 'max'
                }]]
            },
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'},
                    {type: 'min', name: '最小值'}
                ]
            },
            markLine: {
                lineStyle: {
                    normal: {
                        type: 'solid'
                    }
                },
                data: [
                    {type: 'average', name: '平均值'},
                    {xAxis: 170}
                ]
            }
        }
    ]
};

if (option && typeof option === "object") {
    myChart.setOption(option, true);
}